module MLTT.StandardModel.CwF where

open import Decidable
open import Empty
open import Function
open import Identity
open import Instance
open import Level
open import Nat
open import Notation
open import Product
open import Unit

open import WSLN

open import MLTT.Syntax
open import MLTT.Judgement
open import MLTT.TypeSystem
open import MLTT.ContextConversion
open import MLTT.Ok
open import MLTT.WellScoped
open import MLTT.Renaming
open import MLTT.Substitution
open import MLTT.ReflexivityInversion
open import MLTT.AdmissibleRules

----------------------------------------------------------------------
-- The category-with-families structure of sets and functions
----------------------------------------------------------------------

-- Contexts
𝒞𝓍 : Set₂
𝒞𝓍 = Set₁

-- Types
𝒯𝓎 : 𝒞𝓍 → Set₂
𝒯𝓎 C = C → Set₁

-- Terms
𝒯𝓂 : (C : 𝒞𝓍) → 𝒯𝓎 C → Set₁
𝒯𝓂 C T = (c : C) → T c

𝒯𝓎𝒯𝓂 : 𝒞𝓍 → Set₂
𝒯𝓎𝒯𝓂 C = ∑ (𝒯𝓎 C) (𝒯𝓂 C)

-- Comprehension structure
infixl 6 _⋉_
_⋉_ : (C : 𝒞𝓍) → 𝒯𝓎 C → 𝒞𝓍
C ⋉ T = ∑ C T

𝓅₁ :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  → --------
  C ⋉ T → C

𝓅₁ = π₁

𝓅₂ :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  → -----------------
  𝒯𝓂 (C ⋉ T) (T ○ 𝓅₁)

𝓅₂ = π₂

infix 6 ⟪_,_⟫
⟪_,_⟫ :
  {C C' : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  (f : C' → C)
  (t' : 𝒯𝓂 C' (T ○ f))
  → ------------------
  C' → ∑ C T

⟪ f , t' ⟫  = ⟨ f , t' ⟩∑

infixl 6 _○[_]
_○[_] :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  (T' : 𝒯𝓎 (C ⋉ T))
  (t : 𝒯𝓂 C T)
  → ---------------
  𝒯𝓎 C

T' ○[ t ] = T' ○ ⟪ id , t ⟫

infixl 6 _○[_⸴_]
_○[_⸴_] :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  {T' : 𝒯𝓎 (C ⋉ T)}
  (T'' : 𝒯𝓎 (C ⋉ T ⋉ T'))
  (t : 𝒯𝓂 C T)
  (t' : 𝒯𝓂 C (T' ○[ t ]))
  → ---------------------
  𝒯𝓎 C

T'' ○[ t ⸴ t' ] = T'' ○ ⟪ ⟪ id , t ⟫ , t' ⟫


infixl 6 _⋉′_
_⋉′_ :
  {C C' : 𝒞𝓍}
  (f : C' → C)
  (T : 𝒯𝓎 C)
  → --------------------
  (C' ⋉ (T ○ f)) → (C ⋉ T)

f ⋉′ T = ⟪ f ○ 𝓅₁ , 𝓅₂ ⟫


-- Pi-types
𝒫𝒾 :
  {C : 𝒞𝓍}
  (T : 𝒯𝓎 C)
  (T' : 𝒯𝓎 (C ⋉ T))
  → ---------------
  𝒯𝓎 C
𝒫𝒾 T T' c = (t : T c) → T' (c , t)

𝒫𝒾○ :
  {C C' : 𝒞𝓍}
  (T : 𝒯𝓎 C)
  (T' : 𝒯𝓎 (C ⋉ T))
  (f : C' → C)
  → -----------------------------------------
  (𝒫𝒾 T T') ○ f ≡  𝒫𝒾 (T ○ f) (T' ○ (f ⋉′ T))

𝒫𝒾○ T T' f = refl -- uses definitional η-expansion for functions!

𝓁𝒶𝓂 :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  {T' : 𝒯𝓎 (C ⋉ T)}
  (t : 𝒯𝓂 (C ⋉ T) T')
  → -----------------
  𝒯𝓂 C (𝒫𝒾 T T')

𝓁𝒶𝓂 t c t' = t (c , t')

𝒶𝓅𝓅 :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  {T' : 𝒯𝓎 (C ⋉ T)}
  (t' : 𝒯𝓂 C (𝒫𝒾 T T'))
  (t : 𝒯𝓂 C T)
  → ------------------
  𝒯𝓂 C (T' ○[ t ])

𝒶𝓅𝓅 t' t c = t' c (t c)

-- Identity types
ℐ𝒹 :
  {C : 𝒞𝓍}
  (T : 𝒯𝓎 C)
  (t t' : 𝒯𝓂 C T)
  → -------------
  𝒯𝓎 C

ℐ𝒹 T t t' c = (t c ≡ t' c)

𝓇ℯ𝒻𝓁 :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  (t : 𝒯𝓂 C T)
  → -------------
  𝒯𝓂 C (ℐ𝒹 T t t)

𝓇ℯ𝒻𝓁 _ _ = refl

𝒥 :
  {C : 𝒞𝓍}
  {T : 𝒯𝓎 C}
  {t₀ t₁ : 𝒯𝓂 C T}
  (T' : 𝒯𝓎 (C ⋉ T ⋉ ℐ𝒹 (T ○ 𝓅₁ ) (t₀ ○ 𝓅₁) 𝓅₂))
  (_ : 𝒯𝓂 C (T' ○[ t₀ ⸴ 𝓇ℯ𝒻𝓁 t₀ ]))
  (t'' : 𝒯𝓂 C (ℐ𝒹 T t₀ t₁))
  → -------------------------------------------
  𝒯𝓂 C (T' ○[ t₁ ⸴ t'' ])

𝒥 T' t' t'' c = ≡elim
  (λ y e → T' ((c , y) , e))
  (t' c)
  (t'' c)

-- Universe
𝒰 :
  {C : 𝒞𝓍}
  → ------
  𝒯𝓎 C

𝒰 _ = Set

ℰ𝓁 :
  {C : 𝒞𝓍}
  (t : 𝒯𝓂 C 𝒰)
  → ----------
  𝒯𝓎 C

ℰ𝓁 t c = Lift _ (t c)

-- Small Pi-types
𝒫𝒾₀ :
  {C : 𝒞𝓍}
  (T : 𝒯𝓂 C 𝒰)
  (T' : 𝒯𝓂 (C ⋉ ℰ𝓁 T) 𝒰)
  → --------------------
  𝒯𝓂 C 𝒰

𝒫𝒾₀ T T' c = (t : T c) → T' (c , lift t)

-- Small identity types
ℐ𝒹₀ :
  {C : 𝒞𝓍}
  (T : 𝒯𝓂 C 𝒰)
  (t t' : 𝒯𝓂 C (ℰ𝓁 T))
  → ------------------
  𝒯𝓂 C 𝒰

ℐ𝒹₀ T t t' c = lower (t c) ≡ lower (t' c)

-- Natural numbers
𝒩𝒶𝓉 :
  {C : 𝒞𝓍}
  → ------
  𝒯𝓂 C 𝒰

𝒩𝒶𝓉 _ = ℕ

𝓏ℯ𝓇ℴ :
  {C : 𝒞𝓍}
  → -----------
  𝒯𝓂 C (ℰ𝓁 𝒩𝒶𝓉)

𝓏ℯ𝓇ℴ _ = lift 0

𝓈𝓊𝒸𝒸 :
  {C : 𝒞𝓍}
  (t : 𝒯𝓂 C (ℰ𝓁 𝒩𝒶𝓉))
  → -----------------
  𝒯𝓂 C (ℰ𝓁 𝒩𝒶𝓉)

𝓈𝓊𝒸𝒸 t c =  lift (1+(lower (t c)))

𝓃𝓇ℯ𝒸 :
  {C : 𝒞𝓍}
  (T : 𝒯𝓎 (C ⋉ ℰ𝓁 𝒩𝒶𝓉))
  (t₀ : 𝒯𝓂 C (T ○[ 𝓏ℯ𝓇ℴ ]))
  (t₊ : 𝒯𝓂 (C ⋉ ℰ𝓁 𝒩𝒶𝓉 ⋉ T) (T ○ (⟪ 𝓅₁ , 𝓈𝓊𝒸𝒸 𝓅₂ ⟫ ∘ 𝓅₁)))
  (t : 𝒯𝓂 C (ℰ𝓁 𝒩𝒶𝓉))
  → ------------------------------------------------------
  𝒯𝓂 C (T ○[ t ])

𝓃𝓇ℯ𝒸 T t₀ t₊ t c = ℕelim
  (λ x → T (c , (lift x)))
  (t₀ c)
  (λ x y → t₊ ((c , lift x) , y))
  (lower (t c))
