module MLTT.TypeSystem where

open import Identity
open import Nat
open import Notation
open import Product

open import WSLN

open import MLTT.Syntax
open import MLTT.Judgement

----------------------------------------------------------------------
-- Provable judgements in context
----------------------------------------------------------------------
module MLTT where
  infix 3 _⊢_
  data Ok : Cx → Set
  data _⊢_ (Γ : Cx) : Jg → Set

  data Ok where
    -----------------------------
    -- Well-formed contexts: Ok Γ
    -----------------------------
    ◇ : Ok ◇
    ∷ :
      {ℓ : Lvl}
      {Γ : Cx}
      {A : Ty}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q : Γ ⊢ A ∶𝐒𝐞𝐭 ℓ)
      → -----------------
      Ok (Γ ⸴ x ∶[ ℓ ] A)

  data _⊢_  Γ where
    -------------------------------
    -- Well-formed terms: Γ ⊢ a ∶ A
    -------------------------------
    ⊢conv :
      {ℓ : Lvl}
      {a : Tm}
      {A A' : Ty}
      (q₀ : Γ ⊢ a ∶[ ℓ ] A)
      (q₁ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      → -----------------------
      Γ ⊢ a ∶[ ℓ ] A'

    ⊢𝐯 :
      {ℓ : Lvl}
      {A : Ty}
      {x : 𝔸}
      (q₀ : Ok Γ)
      (q₁ : (x , ℓ , A) isIn Γ)
      → -----------------------
      Γ ⊢ 𝐯 x ∶[ ℓ ] A

    ⊢𝐔 :
      {ℓ ℓ' : Lvl}
      (q : Ok Γ)
      → -------------------
      Γ ⊢ 𝐒𝐞𝐭 ℓ ∶𝐒𝐞𝐭 (1+ ℓ)

    ⊢𝚷 :
      {ℓ ℓ' : Lvl}
      {A : Tm}
      {B : Tm[ 1 ]}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ A ∶𝐒𝐞𝐭 ℓ)
      -- Note the use of concretion:
      -- since B is a unary abstraction
      -- B ⟨ x ⟩ is an expression
      (q₁ : (Γ ⸴ x ∶[ ℓ ] A) ⊢ B ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ')
      -- We need that x is fresh for B
      -- in order to be able to deduce that
      -- the support of B is contained in
      -- the domain of Γ (see MLTT.WellScoped)
      (q₂ : x # B)
      → ---------------------------------------
      Γ ⊢ 𝚷 A B ∶𝐒𝐞𝐭 (max ℓ ℓ')

    ⊢𝛌 :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {B : Ty[ 1 ]}
      {b : Tm[ 1 ]}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : (Γ ⸴ x ∶[ ℓ ] A) ⊢ b ⟨ x ⟩ ∶[ ℓ' ] B ⟨ x ⟩)
      (q₁ : x # (B , b))
      → -----------------------------------------------
      Γ ⊢ 𝛌 A b ∶[ max ℓ ℓ' ] 𝚷 A B

    ⊢∙ :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {B : Ty[ 1 ]}
      {a b : Tm}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ b ∶[ max ℓ ℓ' ] 𝚷 A B)
      (q₁ : Γ ⊢ a ∶[ ℓ ] A)
      (q₂ : (Γ ⸴ x ∶[ ℓ ] A) ⊢ B ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₃ : x # B)
      → ---------------------------------------
      Γ ⊢ b ∙[ A , B ] a ∶[ ℓ' ] B ⟨ a ⟩

    ⊢𝐈𝐝 :
      {ℓ : Lvl}
      {A a a' : Tm}
      (q₀ : Γ ⊢ A ∶𝐒𝐞𝐭 ℓ)
      (q₁ : Γ ⊢ a ∶[ ℓ ] A)
      (q₂ : Γ ⊢ a' ∶[ ℓ ] A)
      → --------------------
      Γ ⊢ 𝐈𝐝 A a a' ∶𝐒𝐞𝐭 ℓ

    ⊢𝐫𝐞𝐟𝐥 :
      {ℓ : Lvl}
      {A : Ty}
      {a : Tm}
      (q : Γ ⊢ a ∶[ ℓ ] A)
      → ------------------------
      Γ ⊢ 𝐫𝐞𝐟𝐥 a ∶[ ℓ ] 𝐈𝐝 A a a

    ⊢𝐉 :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {C : Ty[ 2 ]}
      {a b c e : Tm}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : (Γ ⸴ x ∶[ ℓ ] A ⸴ y ∶[ ℓ ] 𝐈𝐝 A a (𝐯 x)) ⊢
        C ⟨ x ⸴ y ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₁ : Γ ⊢ a ∶[ ℓ ] A)
      (q₂ : Γ ⊢ b ∶[ ℓ ] A)
      (q₃ : Γ ⊢ c ∶[ ℓ' ] C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
      (q₄ : Γ ⊢ e ∶[ ℓ ] 𝐈𝐝 A a b)
      (q₅ : x # C)
      (q₆ : y # C)
      → -----------------------------------------------
      Γ ⊢ 𝐉 C a b c e ∶[ ℓ' ] C ⟨ b ⸴ e ⟩

    ⊢𝐍𝐚𝐭 :
      (q : Ok Γ)
      → ------------
      Γ ⊢ 𝐍𝐚𝐭 ∶𝐒𝐞𝐭 0

    ⊢𝐳𝐞𝐫𝐨 :
      (q : Ok Γ)
      → -----------------
      Γ ⊢ 𝐳𝐞𝐫𝐨 ∶[ 0 ] 𝐍𝐚𝐭

    ⊢𝐬𝐮𝐜𝐜 :
      {a : Tm}
      (q : Γ ⊢ a ∶[ 0 ] 𝐍𝐚𝐭)
      → --------------------
      Γ ⊢ 𝐬𝐮𝐜𝐜 a ∶[ 0 ] 𝐍𝐚𝐭

    ⊢𝐧𝐫𝐞𝐜 :
      {ℓ : Lvl}
      {C : Ty[ 1 ]}
      {c₀ a : Tm}
      {c₊ : Tm[ 2 ]}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : Γ ⊢ c₀ ∶[ ℓ ] C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
      (q₁ : (Γ ⸴ x ∶[ 0 ] 𝐍𝐚𝐭 ⸴ y ∶[ ℓ ] C ⟨ x ⟩) ⊢
        c₊ ⟨ x ⸴ y ⟩ ∶[ ℓ ] C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
      (q₂ : Γ ⊢ a ∶[ 0 ] 𝐍𝐚𝐭)
      (q₃ : x # (C , c₊))
      (q₄ : y # c₊)
      → ---------------------------------------------
      Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ∶[ ℓ ] C ⟨ a ⟩

    -----------------------------------
    -- Term conversion: Γ ⊢ a ＝ a' ∶ A
    -----------------------------------
    Refl :
      {ℓ : Lvl}
      {A : Ty}
      {a : Tm}
      (q : Γ ⊢ a ∶[ ℓ ] A)
      → ------------------
      Γ ⊢ a ＝ a ∶[ ℓ ] A

    Symm :
      {ℓ : Lvl}
      {A : Ty}
      {a a' : Tm}
      (q : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      → ------------------------
      Γ ⊢ a' ＝ a ∶[ ℓ ] A

    Trans :
      {ℓ : Lvl}
      {A : Ty}
      {a a' a'' : Tm}
      (q₀ : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      (q₁ : Γ ⊢ a' ＝ a'' ∶[ ℓ ] A)
      → ---------------------------
      Γ ⊢ a ＝ a'' ∶[ ℓ ] A

    ＝conv :
      {ℓ : Lvl}
      {A A' : Ty}
      {a a' : Tm}
      (q₀ : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      (q₁ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      → ------------------------
      Γ ⊢ a ＝ a' ∶[ ℓ ] A'

    𝚷Cong :
      {ℓ ℓ' : Lvl}
      {A A' : Ty}
      {B B' : Ty[ 1 ]}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      (q₁ : Γ ⸴ x ∶[ ℓ ] A ⊢
        B ⟨ x ⟩ ＝ B' ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₂ : x # (B , B'))
      → ----------------------------------
      Γ ⊢ 𝚷 A B ＝ 𝚷 A' B' ∶𝐒𝐞𝐭 (max ℓ ℓ')

    𝛌Cong :
      {ℓ ℓ' : Lvl}
      {A A' : Ty}
      {B : Ty[ 1 ]}
      {b b' : Tm[ 1 ]}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      (q₁ : Γ ⸴ x ∶[ ℓ ] A ⊢
        b ⟨ x ⟩ ＝ b' ⟨ x ⟩ ∶[ ℓ' ] B ⟨ x ⟩)
      (q₂ : x # (B , b , b'))
      → --------------------------------------
      Γ ⊢ 𝛌 A b ＝ 𝛌 A' b' ∶[ max ℓ ℓ' ] 𝚷 A B

    ∙Cong :
      {ℓ ℓ' : Lvl}
      {A A' : Ty}
      {B B' : Ty[ 1 ]}
      {a a' b b' : Tm}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      (q₁ : Γ ⸴ x ∶[ ℓ ] A ⊢ B ⟨ x ⟩ ＝ B' ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₂ : Γ ⊢ b ＝ b' ∶[ max ℓ ℓ' ] 𝚷 A B)
      (q₃ : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      (q₄ : x # (B , B'))
      → ------------------------------------------------------
      Γ ⊢ b ∙[ A , B ] a ＝ b' ∙[ A' , B' ] a' ∶[ ℓ' ] B ⟨ a ⟩

    𝐈𝐝Cong :
      {ℓ : Lvl}
      {A A' : Ty}
      {a a' b b' : Tm}
      (q₀ : Γ ⊢ A ＝ A' ∶𝐒𝐞𝐭 ℓ)
      (q₀ : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      (q₁ : Γ ⊢ b ＝ b' ∶[ ℓ ] A)
      → --------------------------------
      Γ ⊢ 𝐈𝐝 A a b ＝ 𝐈𝐝 A' a' b' ∶𝐒𝐞𝐭 ℓ

    𝐫𝐞𝐟𝐥Cong :
      {ℓ : Lvl}
      {A : Ty}
      {a a' : Tm}
      (q : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      → -----------------------------------
      Γ ⊢ 𝐫𝐞𝐟𝐥 a ＝ 𝐫𝐞𝐟𝐥 a' ∶[ ℓ ] 𝐈𝐝 A a a

    𝐉Cong  :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {C C' : Ty[ 2 ]}
      {a a' b b' c c' e e' : Tm}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : Γ ⸴ x ∶[ ℓ ] A ⸴ y ∶[ ℓ ] 𝐈𝐝 A a (𝐯 x) ⊢
        C ⟨ x ⸴ y ⟩ ＝ C' ⟨ x ⸴ y ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₁ : Γ ⊢ a ＝ a' ∶[ ℓ ] A)
      (q₂ : Γ ⊢ b ＝ b' ∶[ ℓ ] A)
      (q₃ : Γ ⊢ c ＝ c' ∶[ ℓ' ] C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
      (q₄ : Γ ⊢ e ＝ e' ∶[ ℓ ] 𝐈𝐝 A a b)
      (q₅ : x # (C , C'))
      (q₆ : y # (C , C'))
      → -----------------------------------------------------
      Γ ⊢ 𝐉 C a b c e ＝ 𝐉 C' a' b' c' e' ∶[ ℓ' ] C ⟨ b ⸴ e ⟩

    𝐬𝐮𝐜𝐜Cong :
      {a a' : Tm}
      (q : Γ ⊢ a ＝ a' ∶[ 0 ] 𝐍𝐚𝐭)
      → ------------------------------
      Γ ⊢ 𝐬𝐮𝐜𝐜 a ＝ 𝐬𝐮𝐜𝐜 a' ∶[ 0 ] 𝐍𝐚𝐭

    𝐧𝐫𝐞𝐜Cong :
      {ℓ : Lvl}
      {C C' : Ty[ 1 ]}
      {c₀ c₀' a a'  : Tm}
      {c₊ c₊' : Tm[ 2 ]}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : Γ ⸴ x ∶[ 0 ] 𝐍𝐚𝐭 ⊢ C ⟨ x ⟩ ＝ C' ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ)
      (q₁ : Γ ⊢ c₀ ＝ c₀' ∶[ ℓ ] C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
      (q₂ : Γ ⸴ x ∶[ 0 ] 𝐍𝐚𝐭 ⸴ y ∶[ ℓ ] C ⟨ x ⟩ ⊢
        c₊ ⟨ x ⸴ y ⟩ ＝ c₊' ⟨ x ⸴ y ⟩ ∶[ ℓ ] C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
      (q₃ : Γ ⊢ a ＝ a' ∶[ 0 ] 𝐍𝐚𝐭)
      (q₄ : x # (C , C' , c₊ , c₊'))
      (q₅ : y # (c₊ , c₊'))
      → -----------------------------------------------------
      Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ＝ 𝐧𝐫𝐞𝐜 C' c₀' c₊' a' ∶[ ℓ ] C ⟨ a ⟩

    𝚷Beta :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {a : Tm}
      {B : Ty[ 1 ]}
      {b : Tm[ 1 ]}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : (Γ ⸴ x ∶[ ℓ ] A) ⊢ b ⟨ x ⟩ ∶[ ℓ' ] B ⟨ x ⟩)
      (q₁ : Γ ⊢ a ∶[ ℓ ] A)
      (q₂ : x # (B , b))
      → -----------------------------------------------
      Γ ⊢ 𝛌 A b ∙[ A , B ] a ＝ b ⟨ a ⟩ ∶[ ℓ' ] B ⟨ a ⟩

    𝐈𝐝Beta :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {C : Ty[ 2 ]}
      {a c : Tm}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₁ : (Γ ⸴ x ∶[ ℓ ] A ⸴ y ∶[ ℓ ] 𝐈𝐝 A a (𝐯 x)) ⊢
        C ⟨ x ⸴ y ⟩ ∶𝐒𝐞𝐭 ℓ')
      (q₀ : Γ ⊢ a ∶[ ℓ ] A)
      (q₂ : Γ ⊢ c ∶[ ℓ' ] C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
      (q₃ : x # C)
      (q₄ : y # C)
      → --------------------------------------------------
      Γ ⊢ 𝐉 C a a c (𝐫𝐞𝐟𝐥 a) ＝ c ∶[ ℓ' ] C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩

    𝐍𝐚𝐭Beta₀ :
      {ℓ : Lvl}
      {C : Ty[ 1 ]}
      {c₀ : Tm}
      {c₊ : Tm[ 2 ]}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : Γ ⊢ c₀ ∶[ ℓ ] C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
      (q₁ : (Γ ⸴ x ∶[ 0 ] 𝐍𝐚𝐭 ⸴ y ∶[ ℓ ] C ⟨ x ⟩) ⊢
        c₊ ⟨ x ⸴ y ⟩ ∶[ ℓ ] C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
      (q₂ : x # (C , c₊))
      (q₃ : y # c₊)
      → --------------------------------------------
      Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ 𝐳𝐞𝐫𝐨 ＝ c₀ ∶[ ℓ ] C ⟨ 𝐳𝐞𝐫𝐨 ⟩

    𝐍𝐚𝐭Beta₊ :
      {ℓ : Lvl}
      {C : Ty[ 1 ]}
      {c₀ a : Tm}
      {c₊ : Tm[ 2 ]}
      {x y : 𝔸}
      ⦃ _ : x # Γ ⦄
      ⦃ _ : y # (Γ , x) ⦄
      (q₀ : Γ ⊢ c₀ ∶[ ℓ ] C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
      (q₁ : (Γ ⸴ x ∶[ 0 ] 𝐍𝐚𝐭 ⸴ y ∶[ ℓ ] C ⟨ x ⟩) ⊢
        c₊ ⟨ x ⸴ y ⟩ ∶[ ℓ ] C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
      (q₂ : Γ ⊢ a ∶[ 0 ] 𝐍𝐚𝐭)
      (q₃ : x # (C , c₊))
      (q₄ : y # c₊)
      → --------------------------------------------
      Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ (𝐬𝐮𝐜𝐜 a) ＝
      c₊ ⟨ a ⸴ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ⟩ ∶[ ℓ ] C ⟨ 𝐬𝐮𝐜𝐜 a ⟩

    𝚷Eta :
      {ℓ ℓ' : Lvl}
      {A : Ty}
      {B : Ty[ 1 ]}
      {b : Tm}
      {x : 𝔸}
      ⦃ _ : x # Γ ⦄
      (q₀ : Γ ⊢ b ∶[ max ℓ ℓ' ] 𝚷 A B)
      (q₁ : (Γ ⸴ x ∶[ ℓ ] A) ⊢ B ⟨ x ⟩ ∶𝐒𝐞𝐭 ℓ')
      → --------------------------------------------------------
      Γ ⊢ b ＝ 𝛌 A (x ． (b ∙[ A , B ] 𝐯 x)) ∶[ max ℓ ℓ' ] 𝚷 A B
-- end module MLTT

-- ----------------------------------------------------------------------
-- -- An equivalent type system augmented with helper hypotheses
-- -- that aid proofs by structural induction
-- ----------------------------------------------------------------------
-- module MLTT⁺ where
--   infix 3 _⊢_
--   data Ok : Cx → Set
--   data _⊢_ (Γ : Cx) : Jg → Set

--   data Ok where
--     ◇ : Ok ◇
--     ∷ :
--       {ℓ : Lvl}
--       {Γ : Cx}
--       {A : Ty}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       -- helper hypothesis
--       (h : Ok Γ)
--       → ------------------
--       Ok (Γ ⸴ x ∶ A)

--   data _⊢_  Γ where
--     ⊢conv :
--       {ℓ : Lvl}
--       {a : Tm}
--       {A A' : Ty}
--       (q₀ : Γ ⊢ a ∶ A)
--       (q₁ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       → ------------------------
--       Γ ⊢ a ∶ A'

--     ⊢𝐯 :
--       {A : Ty}
--       {x : 𝔸}
--       (q₀ : Ok Γ)
--       (q₁ : (x , A) isIn Γ)
--       → -------------------
--       Γ ⊢ 𝐯 x ∶ A

--     ⊢𝐔 :
--       {ℓ : Lvl}
--       (q : Ok Γ)
--       → --------------------
--       Γ ⊢ 𝐒𝐞𝐭 ℓ ∶ 𝐒𝐞𝐭 (1+ ℓ)

--     ⊢𝚷 :
--       {ℓ ℓ' : Lvl}
--       {A : Tm}
--       {B : Tm[ 1 ]}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₂ : x # B)
--       → -----------------------------------
--       Γ ⊢ 𝚷 A B ∶ 𝐒𝐞𝐭 (max ℓ ℓ')

--     ⊢𝛌 :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {B : Ty[ 1 ]}
--       {b : Tm[ 1 ]}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : (Γ ⸴ x ∶ A) ⊢ b ⟨ x ⟩ ∶ B ⟨ x ⟩)
--       (q₁ : x # (B , b))
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       → ------------------------------------
--       Γ ⊢ 𝛌 A b ∶ 𝚷 A B

--     ⊢∙ :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {B : Ty[ 1 ]}
--       {a b : Tm}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ b ∶ 𝚷 A B)
--       (q₁ : Γ ⊢ a ∶ A)
--       (q₂ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₃ : x # B)
--       -- helper hypothesis
--       (h : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       → ----------------------------------
--       Γ ⊢ b ∙[ A , B ] a ∶ B ⟨ a ⟩

--     ⊢𝐈𝐝 :
--       {ℓ : Lvl}
--       {A a b : Tm}
--       (q₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : Γ ⊢ a ∶ A)
--       (q₂ : Γ ⊢ b ∶ A)
--       → -------------------
--       Γ ⊢ 𝐈𝐝 A a b ∶ 𝐒𝐞𝐭 ℓ

--     ⊢𝐫𝐞𝐟𝐥 :
--       {ℓ : Lvl}
--       {A : Ty}
--       {a : Tm}
--       (q : Γ ⊢ a ∶ A)
--       -- helper hypothesis
--       (h : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       → -------------------
--       Γ ⊢ 𝐫𝐞𝐟𝐥 a ∶ 𝐈𝐝 A a a

--     ⊢𝐉 :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {C : Ty[ 2 ]}
--       {a b c e : Tm}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : (Γ ⸴ x ∶ A ⸴ y ∶ 𝐈𝐝 A a (𝐯 x)) ⊢
--         C ⟨ x ⸴ y ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₁ : Γ ⊢ a ∶ A)
--       (q₂ : Γ ⊢ b ∶ A)
--       (q₃ : Γ ⊢ c ∶ C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
--       (q₄ : Γ ⊢ e ∶ 𝐈𝐝 A a b)
--       (q₅ : x # C)
--       (q₆ : y # C)
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ 𝐈𝐝 A a (𝐯 x) ∶ 𝐒𝐞𝐭 ℓ)
--       → ---------------------------------------
--       Γ ⊢ 𝐉 C a b c e ∶ C ⟨ b ⸴ e ⟩

--     ⊢𝐍𝐚𝐭 :
--       (q : Ok Γ)
--       → ------------
--       Γ ⊢ 𝐍𝐚𝐭 ∶ 𝐒𝐞𝐭₀

--     ⊢𝐳𝐞𝐫𝐨 :
--       (q : Ok Γ)
--       → ------------
--       Γ ⊢ 𝐳𝐞𝐫𝐨 ∶ 𝐍𝐚𝐭

--     ⊢𝐬𝐮𝐜𝐜 :
--       {a : Tm}
--       (q : Γ ⊢ a ∶ 𝐍𝐚𝐭)
--       → ---------------
--       Γ ⊢ 𝐬𝐮𝐜𝐜 a ∶ 𝐍𝐚𝐭

--     ⊢𝐧𝐫𝐞𝐜 :
--       {ℓ : Lvl}
--       {C : Ty[ 1 ]}
--       {c₀ a : Tm}
--       {c₊ : Tm[ 2 ]}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : Γ ⊢ c₀ ∶ C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
--       (q₁ : (Γ ⸴ x ∶ 𝐍𝐚𝐭 ⸴ y ∶ C ⟨ x ⟩) ⊢
--         c₊ ⟨ x ⸴ y ⟩ ∶ C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
--       (q₂ : Γ ⊢ a ∶ 𝐍𝐚𝐭)
--       (q₃ : x # (C , c₊))
--       (q₄ : y # c₊)
--       -- helper hypotheses
--       (h : (Γ ⸴ x ∶ 𝐍𝐚𝐭) ⊢ C ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ)
--       → -----------------------------------
--       Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ∶ C ⟨ a ⟩

--     Refl :
--       {A : Ty}
--       {a : Tm}
--       (q : Γ ⊢ a ∶ A)
--       → -------------
--       Γ ⊢ a ＝ a ∶ A

--     Symm :
--       {A : Ty}
--       {a a' : Tm}
--       (q : Γ ⊢ a ＝ a' ∶ A)
--       → ------------------
--       Γ ⊢ a' ＝ a ∶ A

--     Trans :
--       {A : Ty}
--       {a a' a'' : Tm}
--       (q₀ : Γ ⊢ a ＝ a' ∶ A)
--       (q₁ : Γ ⊢ a' ＝ a'' ∶ A)
--       → ---------------------
--       Γ ⊢ a ＝ a'' ∶ A

--     ＝conv :
--       {ℓ : Lvl}
--       {A A' : Ty}
--       {a a' : Tm}
--       (q₀ : Γ ⊢ a ＝ a' ∶ A)
--       (q₁ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       → ------------------------
--       Γ ⊢ a ＝ a' ∶ A'

--     𝚷Cong :
--       {ℓ ℓ' : Lvl}
--       {A A' : Ty}
--       {B B' : Ty[ 1 ]}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : Γ ⸴ x ∶ A ⊢
--         B ⟨ x ⟩ ＝ B' ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₂ : x # (B , B'))
--       -- helper hypothesis
--       (h : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       → ------------------------------------
--       Γ ⊢ 𝚷 A B ＝ 𝚷 A' B' ∶ 𝐒𝐞𝐭 (max ℓ ℓ')

--     𝛌Cong :
--       {ℓ ℓ' : Lvl}
--       {A A' : Ty}
--       {B : Ty[ 1 ]}
--       {b b' : Tm[ 1 ]}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : Γ ⸴ x ∶ A ⊢
--         b ⟨ x ⟩ ＝ b' ⟨ x ⟩ ∶ B ⟨ x ⟩)
--       (q₂ : x # (B , b , b'))
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       → -----------------------------------
--       Γ ⊢ 𝛌 A b ＝ 𝛌 A' b' ∶ 𝚷 A B

--     ∙Cong :
--       {ℓ ℓ' : Lvl}
--       {A A' : Ty}
--       {B B' : Ty[ 1 ]}
--       {a a' b b' : Tm}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : Γ ⸴ x ∶ A ⊢ B ⟨ x ⟩ ＝ B' ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₂ : Γ ⊢ b ＝ b' ∶ 𝚷 A B)
--       (q₃ : Γ ⊢ a ＝ a' ∶ A)
--       (q₄ : x # (B , B'))
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       → ------------------------------------------------
--       Γ ⊢ b ∙[ A , B ] a ＝ b' ∙[ A' , B' ] a' ∶ B ⟨ a ⟩

--     𝐈𝐝Cong :
--       {ℓ : Lvl}
--       {A A' : Ty}
--       {a a' b b' : Tm}
--       (q₀ : Γ ⊢ A ＝ A' ∶ 𝐒𝐞𝐭 ℓ)
--       (q₀ : Γ ⊢ a ＝ a' ∶ A)
--       (q₁ : Γ ⊢ b ＝ b' ∶ A)
--       → ---------------------------------
--       Γ ⊢ 𝐈𝐝 A a b ＝ 𝐈𝐝 A' a' b' ∶ 𝐒𝐞𝐭 ℓ

--     𝐫𝐞𝐟𝐥Cong :
--       {ℓ : Lvl}
--       {A : Ty}
--       {a a' : Tm}
--       (q : Γ ⊢ a ＝ a' ∶ A)
--       -- helper hypothesis
--       (h : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       → ------------------------------
--       Γ ⊢ 𝐫𝐞𝐟𝐥 a ＝ 𝐫𝐞𝐟𝐥 a' ∶ 𝐈𝐝 A a a

--     𝐉Cong  :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {C C' : Ty[ 2 ]}
--       {a a' b b' c c' e e' : Tm}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : Γ ⸴ x ∶ A ⸴ y ∶ 𝐈𝐝 A a (𝐯 x) ⊢
--         C ⟨ x ⸴ y ⟩ ＝ C' ⟨ x ⸴ y ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₁ : Γ ⊢ a ＝ a' ∶ A)
--       (q₂ : Γ ⊢ b ＝ b' ∶ A)
--       (q₃ : Γ ⊢ c ＝ c' ∶ C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
--       (q₄ : Γ ⊢ e ＝ e' ∶ 𝐈𝐝 A a b)
--       (q₅ : x # (C , C'))
--       (q₆ : y # (C , C'))
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ 𝐈𝐝 A a (𝐯 x) ∶ 𝐒𝐞𝐭 ℓ)
--       → -----------------------------------------------
--       Γ ⊢ 𝐉 C a b c e ＝ 𝐉 C' a' b' c' e' ∶ C ⟨ b ⸴ e ⟩

--     𝐬𝐮𝐜𝐜Cong :
--       {a a' : Tm}
--       (q : Γ ⊢ a ＝ a' ∶ 𝐍𝐚𝐭)
--       → -------------------------
--       Γ ⊢ 𝐬𝐮𝐜𝐜 a ＝ 𝐬𝐮𝐜𝐜 a' ∶ 𝐍𝐚𝐭

--     𝐧𝐫𝐞𝐜Cong :
--       {ℓ : Lvl}
--       {C C' : Ty[ 1 ]}
--       {c₀ c₀' a a'  : Tm}
--       {c₊ c₊' : Tm[ 2 ]}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : Γ ⸴ x ∶ 𝐍𝐚𝐭 ⊢ C ⟨ x ⟩ ＝ C' ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ)
--       (q₁ : Γ ⊢ c₀ ＝ c₀' ∶ C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
--       (q₂ : Γ ⸴ x ∶ 𝐍𝐚𝐭 ⸴ y ∶ C ⟨ x ⟩ ⊢
--         c₊ ⟨ x ⸴ y ⟩ ＝ c₊' ⟨ x ⸴ y ⟩ ∶ C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
--       (q₃ : Γ ⊢ a ＝ a' ∶ 𝐍𝐚𝐭)
--       (q₄ : x # (C , C' , c₊ , c₊'))
--       (q₅ : y # (c₊ , c₊'))
--       -- helper hypotheses
--       (h : (Γ ⸴ x ∶ 𝐍𝐚𝐭) ⊢ C ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ)
--       → ------------------------------------------------
--       Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ＝ 𝐧𝐫𝐞𝐜 C' c₀' c₊' a' ∶ C ⟨ a ⟩

--     𝚷Beta :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {a : Tm}
--       {B : Ty[ 1 ]}
--       {b : Tm[ 1 ]}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : (Γ ⸴ x ∶ A) ⊢ b ⟨ x ⟩ ∶ B ⟨ x ⟩)
--       (q₁ : Γ ⊢ a ∶ A)
--       (q₂ : x # (B , b))
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       → -----------------------------------------
--       Γ ⊢ 𝛌 A b ∙[ A , B ] a ＝ b ⟨ a ⟩ ∶ B ⟨ a ⟩

--     𝐈𝐝Beta :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {C : Ty[ 2 ]}
--       {a c : Tm}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : (Γ ⸴ x ∶ A ⸴ y ∶ 𝐈𝐝 A a (𝐯 x)) ⊢
--         C ⟨ x ⸴ y ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       (q₁ : Γ ⊢ a ∶ A)
--       (q₂ : Γ ⊢ c ∶ C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩)
--       (q₃ : x # C)
--       (q₄ : y # C)
--       -- helper hypotheses
--       (h₀ : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       (h₁ : (Γ ⸴ x ∶ A) ⊢ 𝐈𝐝 A a (𝐯 x) ∶ 𝐒𝐞𝐭 ℓ)
--       → --------------------------------------------
--       Γ ⊢ 𝐉 C a a c (𝐫𝐞𝐟𝐥 a) ＝ c ∶ C ⟨ a ⸴ 𝐫𝐞𝐟𝐥 a ⟩

--     𝐍𝐚𝐭Beta₀ :
--       {ℓ : Lvl}
--       {C : Ty[ 1 ]}
--       {c₀ : Tm}
--       {c₊ : Tm[ 2 ]}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : Γ ⊢ c₀ ∶ C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
--       (q₁ : (Γ ⸴ x ∶ 𝐍𝐚𝐭 ⸴ y ∶ C ⟨ x ⟩) ⊢
--         c₊ ⟨ x ⸴ y ⟩ ∶ C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
--       (q₂ : x # (C , c₊))
--       (q₃ : y # c₊)
--       -- helper hypotheses
--       (h : (Γ ⸴ x ∶ 𝐍𝐚𝐭) ⊢ C ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ)
--       → --------------------------------------
--       Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ 𝐳𝐞𝐫𝐨 ＝ c₀ ∶ C ⟨ 𝐳𝐞𝐫𝐨 ⟩

--     𝐍𝐚𝐭Beta₊ :
--       {ℓ : Lvl}
--       {C : Ty[ 1 ]}
--       {c₀ a : Tm}
--       {c₊ : Tm[ 2 ]}
--       {x y : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       ⦃ _ : y # (Γ , x) ⦄
--       (q₀ : Γ ⊢ c₀ ∶ C ⟨ 𝐳𝐞𝐫𝐨 ⟩)
--       (q₁ : (Γ ⸴ x ∶ 𝐍𝐚𝐭 ⸴ y ∶ C ⟨ x ⟩) ⊢
--         c₊ ⟨ x ⸴ y ⟩ ∶ C ⟨ 𝐬𝐮𝐜𝐜 (𝐯 x) ⟩)
--       (q₂ : Γ ⊢ a ∶ 𝐍𝐚𝐭)
--       (q₃ : x # (C , c₊))
--       (q₄ : y # c₊)
--       -- helper hypothesis
--       (h : (Γ ⸴ x ∶ 𝐍𝐚𝐭) ⊢ C ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ)
--       → --------------------------------------
--       Γ ⊢ 𝐧𝐫𝐞𝐜 C c₀ c₊ (𝐬𝐮𝐜𝐜 a) ＝
--       c₊ ⟨ a ⸴ 𝐧𝐫𝐞𝐜 C c₀ c₊ a ⟩ ∶ C ⟨ 𝐬𝐮𝐜𝐜 a ⟩

--     𝚷Eta :
--       {ℓ ℓ' : Lvl}
--       {A : Ty}
--       {B : Ty[ 1 ]}
--       {b : Tm}
--       {x : 𝔸}
--       ⦃ _ : x # Γ ⦄
--       (q₀ : Γ ⊢ b ∶ 𝚷 A B)
--       (q₁ : (Γ ⸴ x ∶ A) ⊢ B ⟨ x ⟩ ∶ 𝐒𝐞𝐭 ℓ')
--       -- helper hypothesis
--       (h : Γ ⊢ A ∶ 𝐒𝐞𝐭 ℓ)
--       → --------------------------------------------
--       Γ ⊢ b ＝ 𝛌 A (x ． (b ∙[ A , B ] 𝐯 x)) ∶ 𝚷 A B
-- -- end module MLTT+
